bog-app/app/controllers/creatures_controller.rb

  def index
    @creatures = Creature.all
---
SELECT "creatures".* FROM "creatures"

  def show
    @creature = Creature.find_by_id(id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    creature = Creature.new(creature_params)
    redirect_to root_path if creature.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "adsfdfs"], ["description", "adsfdfs"], ["created_at", 2016-12-18 21:38:30 UTC], ["updated_at", 2016-12-18 21:38:30 UTC]]

  def edit
    @creature = Creature.find_by_id(id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    Creature.find_by_id(id).update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "adsfdasf"], ["updated_at", 2016-12-18 21:39:51 UTC], ["id", 2]]

  def destroy
    Creature.find_by_id(id).destroy
---
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 2]]
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]