bog_app/app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
  def index
    @creatures = Creature.all

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["description", ""], ["created_at", 2016-12-17 20:54:02 UTC], ["updated_at", 2016-12-17 20:54:02 UTC]]
---
  def create
    creature = Creature.new(creature_params)
    redirect_to creature_path(creature) if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @creature = Creature.find_by_id(id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def edit
    id = params[:id]
    @creature = Creature.find_by_id(id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "creatures" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "creatures"."id" = $4  [["name", "d;saklfj"], ["description", "a;sdlfjk\r\n"], ["updated_at", 2016-12-17 21:49:13 UTC], ["id", 4]]
---
  def update
    id = params[:id]
    Creature.find_by_id(id).update_attributes(creature_params)

DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 4]]
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    id = params[:id]
    Creature.find_by_id(id).delete